742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
        }
        break;
    case 0x02:
        break;
    case 0x03:
        break;
    case 0x04:
        break;
    default:
		FrameCmdLocalAck(frameCmd,0,0);
        break;
    }
}


//串口接收处理
void UartRx_Process(UpCom_Rx_TypDef *prx_ubuf, DevicePara_TypDef *p_device)
{
    FRAME_CMD_t *frameCmd;
	uint8_t send_len;
    frameCmd = (FRAME_CMD_t *)prx_ubuf->Frame_Data;
	

    if (prx_ubuf->Rx_Status == UartRx_Finished)
    {
        if (0 == FrameData_Detect(prx_ubuf->Frame_Data, prx_ubuf->FrameTotalLen))
        {
			if(frameCmd->FameHead == HKFreamHeader)
			{
				if(frameCmd->Ctrl.dir == 0)					//主站（安卓版）下行数据
				{
					if(frameCmd->Ctrl.relayFlag == 0)	//本地（发给扩展板）
					{
						if(frameCmd->Ctrl.eventFlag == 0) //命令
						{
							Local_CmdProcess(frameCmd);
						}
						else  if(frameCmd->Ctrl.eventFlag == 1)		//事件(应答)
						{

						}

					}
					else if(frameCmd->Ctrl.relayFlag == 1)	//转发（发给电器设备）
					{
						if(frameCmd->Ctrl.eventFlag == 0) //命令
						{
							FrameCmdLocalAck(frameCmd,0,0);
							if(frameCmd->FSQ.encryptType)  //加密
							{
								send_len = Encrypt_Convert((uint8_t*)frameCmd, frameCmd->DataLen+11, 0); 
							}
							else						//不加密
							{
								send_len = frameCmd->DataLen+11;
							}
							Si4438_Transmit_Start(&Wireless_Buf, Default_Channel, (uint8_t*)frameCmd, send_len);       //串口数据无线转发
						}
						else  if(frameCmd->Ctrl.eventFlag == 1)		//事件(应答)
						{

						}
						
					}
				}
			}
			else if(frameCmd->FameHead == AESFreamHeader)		//烧录MAC地址
			{

				MacFrame_Process(prx_ubuf->Frame_Data,HKFrame_Buf.FrameProcess_Buf);
				memcpy(deviceInfo.mac,Local_MAC_Addr +3,8);
				deviceInfo.mac_exist = 1;
				STMFLASH_Write(DEVICE_INFO_BASH_ADDR,(uint16_t*)&deviceInfo,(sizeof(deviceInfo)+1)/2);
			}
        }

        prx_ubuf->Rx_Status = UartRx_FrameHead;
    }
}

//uint8_t frameTest[256]={
//0x69,0x69,0x39,0xC6,0x00,0x29,0x02,0x04,0x02,0x00,0x01,0x00,0x01,0x24,
//0x01,0x30,0x0F,0x00,0xAC,0x24,0x00,0x29,0x02,0x06,0x10,0x1C,0x80,0xFF,
//0xFF,0xFF,0x04,0x02,0x00,0x01,0x00,0x01,0x24,0x01,0x57,0xDB,0xF8,0xCF,
//0x2D,0xD2,0x00,0x79,0x8F,0x97,0x70,0x70,0x2A,0x1A,0x8F,0xCB,0x09,0xBF,
//0x53,0xD9,0x06,0x96,0x96};
//uint8_t frameTest[256]={
//0x69,0x69,0x32,0xCD,0x01,0x29,0x02,0x24,0x30,0x0F,0x00,0xAC,0x32,0x00,0x29,
//0x02,0x06,0x10,0x1C,0x80,0xFF,0xFF,0xFF,0x04,0x02,0x00,0x01,0x00,0x00,0x32,
//0x11,0x57,0xDB,0xF8,0xCF,0x2D,0xD2,0x00,0x79,0x8F,0x97,0x70,0x70,0x2A,0x1A,
//0x8F,0xCB,0x09,0xBF,0x53,0xCE,0x0F,0x96,0x96};
uint8_t frameTest[256]={
0x69,0x69,0x33,0xCC,0x01,0x29,0x02,0x24,0x30,0x1F,0x01,0x24,0xAC,0x32,0x00,
0x29,0x02,0x06,0x10,0x1C,0x80,0xFF,0xFF,0xFF,0x04,0x02,0x00,0x01,0x00,0x00,
0x32,0x11,0x57,0xDB,0xF8,0xCF,0x2D,0xD2,0x00,0x79,0x8F,0x97,0x70,0x70,0x2A,
0x1A,0x8F,0xCB,0x09,0xBF,0x53,0x6D,0x1D,0x96,0x96};
//路由协议帧数据处理，主要针对无线和电力线载波
void FrameRouterDataProcess(uint8_t *rx_buff,uint8_t rx_len)
{
	
	FRAME_ROUTER_CMD_t *frameData = (FRAME_ROUTER_CMD_t*)rx_buff;					//通信帧数据结构
	FRAME_ROUTER_EXT_CMD_t* frameData_ext = (FRAME_ROUTER_EXT_CMD_t*)rx_buff;        //配网帧数据结构

	uint8_t *routerTable;		//路由表指针
	uint8_t *userFrame;         //应用命令帧指针
	FRAME_CMD_t **frame_cmd;    //应用命令帧指针的指针
	
		
	//判断帧头
	if((frameData->head_h != 0x69)||(frameData->head_l != 0x69))
	{
		return;
	} 
	//FrameData_74Convert()
	//判断长度是否正确
	if((frameData->len+frameData->len_c)!=0xff)
	{
		return;
	}

	
	if(frameData->ctrl.type == 1)	//通信帧
	{
		routerTable = &rx_buff[11];
		userFrame = &rx_buff[11+frameData->router_len];
		UartSendBytes(USART1,routerTable,frameData->router_len);

	}
	else if(frameData->ctrl.type == 0) //组网帧
	{

		routerTable = &rx_buff[18];
		userFrame = &rx_buff[18+frameData_ext->router_len];
		UartSendBytes(USART1,routerTable,frameData_ext->router_len);

	}
	delay_ms(1000);
	frame_cmd = (FRAME_CMD_t**)&userFrame;
	UartSendBytes(USART1,(uint8_t*)*frame_cmd,(*frame_cmd)->DataLen+11);
	
}



extern osThreadId UartTaskHandle;

void WireLess_Process(WLS *p_wl, DevicePara_TypDef *p_device)
{
    static uint8_t Wireless_ErrCnt = 0;
	uint8_t out_len;
	uint8_t frame_type;

    if (WIRELESS_STATUS == Wireless_RX_Finish) //Receive Finish
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
       
		
		#ifdef Use_74dcode
		//74解码
		if (((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X07) && ((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X02)) //带编码能力的电器回复无cmd标识
		{
			FrameData_74Convert((FRAME_CMD_t*)p_wl->Wireless_RxData,p_wl->Wireless_PacketLength,&out_len,0);
			p_wl->Wireless_PacketLength = out_len;
		}
		#endif
			
		//校验帧头和CRC16	
        if (0 == FrameData_Detect(p_wl->Wireless_RxData, p_wl->Wireless_PacketLength))
        {
            frame_type = p_wl->Wireless_RxData[Region_CmdNumber] & 0x98;
            p_device->Pending_Flag &= 0x0f;

            if (frame_type == RemoteDown_CmdFrame)
            {
				xTaskNotify(UartTaskHandle,0x10<<8, eSetValueWithOverwrite);
            }
            else if (frame_type == RemoteDown_EventFrame)
            {
				xTaskNotify(UartTaskHandle, 0x20<<8, eSetValueWithOverwrite);
            }
            else
			{
                Si4438_Receive_Start(Wireless_Channel[0]);
			}
        }
		else
		{
			Si4438_Receive_Start(Wireless_Channel[0]);
		} 
		if (WIRELESS_STATUS == Wireless_Free)	
		{			
			Si4438_Receive_Start(Wireless_Channel[0]);
		}
    }
    else if (WIRELESS_ERROR_CODE == Wireless_CmdResponseError)
    {
        WIRELESS_ERROR_CODE = Wireless_NoError;
        /*Si4438_Receive_Start(Wireless_Channel[0]);   //Start Receive*/
        if (++Wireless_ErrCnt > 10)
            WIRELESS_ERROR_CODE = Wireless_InitError;
    }

    if (WIRELESS_ERROR_CODE == Wireless_ExecuteError) //Channel Busy
    {
        WIRELESS_STATUS = Wireless_Free;

        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    if (WIRELESS_STATUS == Wireless_TX_Finish)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        //LEDR_INVERSE();
        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    else if (WIRELESS_STATUS == Wireless_RX_Failure)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        Res_FifoInfo(RESET_RECEIVE);
        //Si4438_Receive_Start(Wireless_Channel[0]);         //Start Receive
    }    
}

void System_8msTick_Process(void)
{
    if ((WIRELESS_STATUS == Wireless_RX_Receiving) && (!!NIRQ_RDPIN() == 0))
    {
        Si4438_Receive_Start(Wireless_Channel[0]); //Restart Receive
    }
    if (WIRELESS_ERROR_CODE == Wireless_Busy) //Channel Busy
    {
        if (Wireless_Buf.Channel_Busy_cnt) // Send Ready
        {
            if (++Wireless_Buf.Channel_Busy_cnt > BUSY_TIMEOUT)
            {
                Wireless_Buf.Channel_Busy_cnt = 0;

